"""
Побудувати масив V=(vi), елементи якого задаються формулою:
v_1=a , v_2=b v_i=1/2*(v_(i-1) + x/v_(i-2)) , i = 3,4,...,n
де a, b, х – вводяться з клавіатури. Обчислити добуток елементів масиву V з парними індексами
"""
"""
a - float значення першого елемента
b - float значення другого елемента
x - float змінна
n - int номер елемента
v - елемент

"""
# введення
a = float(input('a= '))
b = float(input('b= '))
x = float(input('x= '))
n = int(input('Введіть кількість елементів n:'))
v = [a, b, ]
v[0] = a
v[1] = b
# додавання елементів у масив
for i in range(2, n+1):
    s = (1/2)*(b + x/a)
    v.append(s)
    a = b
    b = s
# обчислення добутку
for i in range(n):
    if i % 2 == 0:
       dobutok = v[i]
# виведення
print(v)
print('Добуток={0}'.format(dobutok))